zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg00/include/pio/pic32ck1025sg00144.h
/*
 * Peripheral I/O description for pic32ck1025sg00144
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2025-07-03T22:18:58Z  */
#ifndef _pic32ck1025sg00144_GPIO_H_
#define _pic32ck1025sg00144_GPIO_H_

/* ======================= Peripheral I/O pin numbers ======================= */
#define PIN_PA00                    (    0)  /* Pin Number for PA00 */
#define PIN_PA01                    (    1)  /* Pin Number for PA01 */
#define PIN_PA02                    (    2)  /* Pin Number for PA02 */
#define PIN_PA03                    (    3)  /* Pin Number for PA03 */
#define PIN_PA04                    (    4)  /* Pin Number for PA04 */
#define PIN_PA05                    (    5)  /* Pin Number for PA05 */
#define PIN_PA06                    (    6)  /* Pin Number for PA06 */
#define PIN_PA07                    (    7)  /* Pin Number for PA07 */
#define PIN_PA08                    (    8)  /* Pin Number for PA08 */
#define PIN_PA09                    (    9)  /* Pin Number for PA09 */
#define PIN_PA10                    (   10)  /* Pin Number for PA10 */
#define PIN_PA11                    (   11)  /* Pin Number for PA11 */
#define PIN_PA12                    (   12)  /* Pin Number for PA12 */
#define PIN_PA13                    (   13)  /* Pin Number for PA13 */
#define PIN_PA14                    (   14)  /* Pin Number for PA14 */
#define PIN_PA15                    (   15)  /* Pin Number for PA15 */
#define PIN_PA16                    (   16)  /* Pin Number for PA16 */
#define PIN_PA17                    (   17)  /* Pin Number for PA17 */
#define PIN_PA18                    (   18)  /* Pin Number for PA18 */
#define PIN_PA19                    (   19)  /* Pin Number for PA19 */
#define PIN_PA20                    (   20)  /* Pin Number for PA20 */
#define PIN_PA21                    (   21)  /* Pin Number for PA21 */
#define PIN_PA22                    (   22)  /* Pin Number for PA22 */
#define PIN_PA23                    (   23)  /* Pin Number for PA23 */
#define PIN_PA24                    (   24)  /* Pin Number for PA24 */
#define PIN_PA25                    (   25)  /* Pin Number for PA25 */
#define PIN_PA26                    (   26)  /* Pin Number for PA26 */
#define PIN_PA27                    (   27)  /* Pin Number for PA27 */
#define PIN_PA28                    (   28)  /* Pin Number for PA28 */
#define PIN_PB00                    (   32)  /* Pin Number for PB00 */
#define PIN_PB01                    (   33)  /* Pin Number for PB01 */
#define PIN_PB02                    (   34)  /* Pin Number for PB02 */
#define PIN_PB03                    (   35)  /* Pin Number for PB03 */
#define PIN_PB04                    (   36)  /* Pin Number for PB04 */
#define PIN_PB05                    (   37)  /* Pin Number for PB05 */
#define PIN_PB06                    (   38)  /* Pin Number for PB06 */
#define PIN_PB07                    (   39)  /* Pin Number for PB07 */
#define PIN_PB08                    (   40)  /* Pin Number for PB08 */
#define PIN_PB09                    (   41)  /* Pin Number for PB09 */
#define PIN_PB10                    (   42)  /* Pin Number for PB10 */
#define PIN_PB11                    (   43)  /* Pin Number for PB11 */
#define PIN_PB12                    (   44)  /* Pin Number for PB12 */
#define PIN_PB13                    (   45)  /* Pin Number for PB13 */
#define PIN_PB14                    (   46)  /* Pin Number for PB14 */
#define PIN_PB15                    (   47)  /* Pin Number for PB15 */
#define PIN_PB16                    (   48)  /* Pin Number for PB16 */
#define PIN_PB17                    (   49)  /* Pin Number for PB17 */
#define PIN_PB18                    (   50)  /* Pin Number for PB18 */
#define PIN_PB19                    (   51)  /* Pin Number for PB19 */
#define PIN_PB20                    (   52)  /* Pin Number for PB20 */
#define PIN_PB21                    (   53)  /* Pin Number for PB21 */
#define PIN_PB22                    (   54)  /* Pin Number for PB22 */
#define PIN_PB23                    (   55)  /* Pin Number for PB23 */
#define PIN_PB24                    (   56)  /* Pin Number for PB24 */
#define PIN_PB25                    (   57)  /* Pin Number for PB25 */
#define PIN_PB26                    (   58)  /* Pin Number for PB26 */
#define PIN_PC00                    (   64)  /* Pin Number for PC00 */
#define PIN_PC01                    (   65)  /* Pin Number for PC01 */
#define PIN_PC02                    (   66)  /* Pin Number for PC02 */
#define PIN_PC03                    (   67)  /* Pin Number for PC03 */
#define PIN_PC04                    (   68)  /* Pin Number for PC04 */
#define PIN_PC05                    (   69)  /* Pin Number for PC05 */
#define PIN_PC06                    (   70)  /* Pin Number for PC06 */
#define PIN_PC07                    (   71)  /* Pin Number for PC07 */
#define PIN_PC09                    (   73)  /* Pin Number for PC09 */
#define PIN_PC10                    (   74)  /* Pin Number for PC10 */
#define PIN_PC11                    (   75)  /* Pin Number for PC11 */
#define PIN_PC12                    (   76)  /* Pin Number for PC12 */
#define PIN_PC13                    (   77)  /* Pin Number for PC13 */
#define PIN_PC14                    (   78)  /* Pin Number for PC14 */
#define PIN_PC15                    (   79)  /* Pin Number for PC15 */
#define PIN_PC16                    (   80)  /* Pin Number for PC16 */
#define PIN_PC17                    (   81)  /* Pin Number for PC17 */
#define PIN_PC18                    (   82)  /* Pin Number for PC18 */
#define PIN_PC19                    (   83)  /* Pin Number for PC19 */
#define PIN_PC20                    (   84)  /* Pin Number for PC20 */
#define PIN_PC21                    (   85)  /* Pin Number for PC21 */
#define PIN_PC22                    (   86)  /* Pin Number for PC22 */
#define PIN_PC23                    (   87)  /* Pin Number for PC23 */
#define PIN_PC24                    (   88)  /* Pin Number for PC24 */
#define PIN_PC25                    (   89)  /* Pin Number for PC25 */
#define PIN_PC26                    (   90)  /* Pin Number for PC26 */
#define PIN_PC27                    (   91)  /* Pin Number for PC27 */
#define PIN_PC28                    (   92)  /* Pin Number for PC28 */
#define PIN_PC29                    (   93)  /* Pin Number for PC29 */
#define PIN_PD00                    (   96)  /* Pin Number for PD00 */
#define PIN_PD01                    (   97)  /* Pin Number for PD01 */
#define PIN_PD02                    (   98)  /* Pin Number for PD02 */
#define PIN_PD03                    (   99)  /* Pin Number for PD03 */
#define PIN_PD04                    (  100)  /* Pin Number for PD04 */
#define PIN_PD05                    (  101)  /* Pin Number for PD05 */
#define PIN_PD06                    (  102)  /* Pin Number for PD06 */
#define PIN_PD07                    (  103)  /* Pin Number for PD07 */
#define PIN_PD08                    (  104)  /* Pin Number for PD08 */
#define PIN_PD09                    (  105)  /* Pin Number for PD09 */
#define PIN_PD10                    (  106)  /* Pin Number for PD10 */
#define PIN_PD11                    (  107)  /* Pin Number for PD11 */
#define PIN_PD12                    (  108)  /* Pin Number for PD12 */
#define PIN_PD13                    (  109)  /* Pin Number for PD13 */
#define PIN_PD14                    (  110)  /* Pin Number for PD14 */
#define PIN_PD15                    (  111)  /* Pin Number for PD15 */
#define PIN_PD16                    (  112)  /* Pin Number for PD16 */
#define PIN_PD17                    (  113)  /* Pin Number for PD17 */
#define PIN_PD18                    (  114)  /* Pin Number for PD18 */
#define PIN_PD19                    (  115)  /* Pin Number for PD19 */
#define PIN_PD20                    (  116)  /* Pin Number for PD20 */
#define PIN_PD21                    (  117)  /* Pin Number for PD21 */

/* ========================== Peripheral I/O masks ========================== */
#define PORT_PA00                   (_UINT32_(1) << 0) /* PORT mask for PA00 */
#define PORT_PA01                   (_UINT32_(1) << 1) /* PORT mask for PA01 */
#define PORT_PA02                   (_UINT32_(1) << 2) /* PORT mask for PA02 */
#define PORT_PA03                   (_UINT32_(1) << 3) /* PORT mask for PA03 */
#define PORT_PA04                   (_UINT32_(1) << 4) /* PORT mask for PA04 */
#define PORT_PA05                   (_UINT32_(1) << 5) /* PORT mask for PA05 */
#define PORT_PA06                   (_UINT32_(1) << 6) /* PORT mask for PA06 */
#define PORT_PA07                   (_UINT32_(1) << 7) /* PORT mask for PA07 */
#define PORT_PA08                   (_UINT32_(1) << 8) /* PORT mask for PA08 */
#define PORT_PA09                   (_UINT32_(1) << 9) /* PORT mask for PA09 */
#define PORT_PA10                   (_UINT32_(1) << 10) /* PORT mask for PA10 */
#define PORT_PA11                   (_UINT32_(1) << 11) /* PORT mask for PA11 */
#define PORT_PA12                   (_UINT32_(1) << 12) /* PORT mask for PA12 */
#define PORT_PA13                   (_UINT32_(1) << 13) /* PORT mask for PA13 */
#define PORT_PA14                   (_UINT32_(1) << 14) /* PORT mask for PA14 */
#define PORT_PA15                   (_UINT32_(1) << 15) /* PORT mask for PA15 */
#define PORT_PA16                   (_UINT32_(1) << 16) /* PORT mask for PA16 */
#define PORT_PA17                   (_UINT32_(1) << 17) /* PORT mask for PA17 */
#define PORT_PA18                   (_UINT32_(1) << 18) /* PORT mask for PA18 */
#define PORT_PA19                   (_UINT32_(1) << 19) /* PORT mask for PA19 */
#define PORT_PA20                   (_UINT32_(1) << 20) /* PORT mask for PA20 */
#define PORT_PA21                   (_UINT32_(1) << 21) /* PORT mask for PA21 */
#define PORT_PA22                   (_UINT32_(1) << 22) /* PORT mask for PA22 */
#define PORT_PA23                   (_UINT32_(1) << 23) /* PORT mask for PA23 */
#define PORT_PA24                   (_UINT32_(1) << 24) /* PORT mask for PA24 */
#define PORT_PA25                   (_UINT32_(1) << 25) /* PORT mask for PA25 */
#define PORT_PA26                   (_UINT32_(1) << 26) /* PORT mask for PA26 */
#define PORT_PA27                   (_UINT32_(1) << 27) /* PORT mask for PA27 */
#define PORT_PA28                   (_UINT32_(1) << 28) /* PORT mask for PA28 */
#define PORT_PB00                   (_UINT32_(1) << 0) /* PORT mask for PB00 */
#define PORT_PB01                   (_UINT32_(1) << 1) /* PORT mask for PB01 */
#define PORT_PB02                   (_UINT32_(1) << 2) /* PORT mask for PB02 */
#define PORT_PB03                   (_UINT32_(1) << 3) /* PORT mask for PB03 */
#define PORT_PB04                   (_UINT32_(1) << 4) /* PORT mask for PB04 */
#define PORT_PB05                   (_UINT32_(1) << 5) /* PORT mask for PB05 */
#define PORT_PB06                   (_UINT32_(1) << 6) /* PORT mask for PB06 */
#define PORT_PB07                   (_UINT32_(1) << 7) /* PORT mask for PB07 */
#define PORT_PB08                   (_UINT32_(1) << 8) /* PORT mask for PB08 */
#define PORT_PB09                   (_UINT32_(1) << 9) /* PORT mask for PB09 */
#define PORT_PB10                   (_UINT32_(1) << 10) /* PORT mask for PB10 */
#define PORT_PB11                   (_UINT32_(1) << 11) /* PORT mask for PB11 */
#define PORT_PB12                   (_UINT32_(1) << 12) /* PORT mask for PB12 */
#define PORT_PB13                   (_UINT32_(1) << 13) /* PORT mask for PB13 */
#define PORT_PB14                   (_UINT32_(1) << 14) /* PORT mask for PB14 */
#define PORT_PB15                   (_UINT32_(1) << 15) /* PORT mask for PB15 */
#define PORT_PB16                   (_UINT32_(1) << 16) /* PORT mask for PB16 */
#define PORT_PB17                   (_UINT32_(1) << 17) /* PORT mask for PB17 */
#define PORT_PB18                   (_UINT32_(1) << 18) /* PORT mask for PB18 */
#define PORT_PB19                   (_UINT32_(1) << 19) /* PORT mask for PB19 */
#define PORT_PB20                   (_UINT32_(1) << 20) /* PORT mask for PB20 */
#define PORT_PB21                   (_UINT32_(1) << 21) /* PORT mask for PB21 */
#define PORT_PB22                   (_UINT32_(1) << 22) /* PORT mask for PB22 */
#define PORT_PB23                   (_UINT32_(1) << 23) /* PORT mask for PB23 */
#define PORT_PB24                   (_UINT32_(1) << 24) /* PORT mask for PB24 */
#define PORT_PB25                   (_UINT32_(1) << 25) /* PORT mask for PB25 */
#define PORT_PB26                   (_UINT32_(1) << 26) /* PORT mask for PB26 */
#define PORT_PC00                   (_UINT32_(1) << 0) /* PORT mask for PC00 */
#define PORT_PC01                   (_UINT32_(1) << 1) /* PORT mask for PC01 */
#define PORT_PC02                   (_UINT32_(1) << 2) /* PORT mask for PC02 */
#define PORT_PC03                   (_UINT32_(1) << 3) /* PORT mask for PC03 */
#define PORT_PC04                   (_UINT32_(1) << 4) /* PORT mask for PC04 */
#define PORT_PC05                   (_UINT32_(1) << 5) /* PORT mask for PC05 */
#define PORT_PC06                   (_UINT32_(1) << 6) /* PORT mask for PC06 */
#define PORT_PC07                   (_UINT32_(1) << 7) /* PORT mask for PC07 */
#define PORT_PC09                   (_UINT32_(1) << 9) /* PORT mask for PC09 */
#define PORT_PC10                   (_UINT32_(1) << 10) /* PORT mask for PC10 */
#define PORT_PC11                   (_UINT32_(1) << 11) /* PORT mask for PC11 */
#define PORT_PC12                   (_UINT32_(1) << 12) /* PORT mask for PC12 */
#define PORT_PC13                   (_UINT32_(1) << 13) /* PORT mask for PC13 */
#define PORT_PC14                   (_UINT32_(1) << 14) /* PORT mask for PC14 */
#define PORT_PC15                   (_UINT32_(1) << 15) /* PORT mask for PC15 */
#define PORT_PC16                   (_UINT32_(1) << 16) /* PORT mask for PC16 */
#define PORT_PC17                   (_UINT32_(1) << 17) /* PORT mask for PC17 */
#define PORT_PC18                   (_UINT32_(1) << 18) /* PORT mask for PC18 */
#define PORT_PC19                   (_UINT32_(1) << 19) /* PORT mask for PC19 */
#define PORT_PC20                   (_UINT32_(1) << 20) /* PORT mask for PC20 */
#define PORT_PC21                   (_UINT32_(1) << 21) /* PORT mask for PC21 */
#define PORT_PC22                   (_UINT32_(1) << 22) /* PORT mask for PC22 */
#define PORT_PC23                   (_UINT32_(1) << 23) /* PORT mask for PC23 */
#define PORT_PC24                   (_UINT32_(1) << 24) /* PORT mask for PC24 */
#define PORT_PC25                   (_UINT32_(1) << 25) /* PORT mask for PC25 */
#define PORT_PC26                   (_UINT32_(1) << 26) /* PORT mask for PC26 */
#define PORT_PC27                   (_UINT32_(1) << 27) /* PORT mask for PC27 */
#define PORT_PC28                   (_UINT32_(1) << 28) /* PORT mask for PC28 */
#define PORT_PC29                   (_UINT32_(1) << 29) /* PORT mask for PC29 */
#define PORT_PD00                   (_UINT32_(1) << 0) /* PORT mask for PD00 */
#define PORT_PD01                   (_UINT32_(1) << 1) /* PORT mask for PD01 */
#define PORT_PD02                   (_UINT32_(1) << 2) /* PORT mask for PD02 */
#define PORT_PD03                   (_UINT32_(1) << 3) /* PORT mask for PD03 */
#define PORT_PD04                   (_UINT32_(1) << 4) /* PORT mask for PD04 */
#define PORT_PD05                   (_UINT32_(1) << 5) /* PORT mask for PD05 */
#define PORT_PD06                   (_UINT32_(1) << 6) /* PORT mask for PD06 */
#define PORT_PD07                   (_UINT32_(1) << 7) /* PORT mask for PD07 */
#define PORT_PD08                   (_UINT32_(1) << 8) /* PORT mask for PD08 */
#define PORT_PD09                   (_UINT32_(1) << 9) /* PORT mask for PD09 */
#define PORT_PD10                   (_UINT32_(1) << 10) /* PORT mask for PD10 */
#define PORT_PD11                   (_UINT32_(1) << 11) /* PORT mask for PD11 */
#define PORT_PD12                   (_UINT32_(1) << 12) /* PORT mask for PD12 */
#define PORT_PD13                   (_UINT32_(1) << 13) /* PORT mask for PD13 */
#define PORT_PD14                   (_UINT32_(1) << 14) /* PORT mask for PD14 */
#define PORT_PD15                   (_UINT32_(1) << 15) /* PORT mask for PD15 */
#define PORT_PD16                   (_UINT32_(1) << 16) /* PORT mask for PD16 */
#define PORT_PD17                   (_UINT32_(1) << 17) /* PORT mask for PD17 */
#define PORT_PD18                   (_UINT32_(1) << 18) /* PORT mask for PD18 */
#define PORT_PD19                   (_UINT32_(1) << 19) /* PORT mask for PD19 */
#define PORT_PD20                   (_UINT32_(1) << 20) /* PORT mask for PD20 */
#define PORT_PD21                   (_UINT32_(1) << 21) /* PORT mask for PD21 */

/* =================== PORT definition for AC peripheral ==================== */
#define PIN_PA06B_AC_AIN0                          _UINT32_(6) 
#define MUX_PA06B_AC_AIN0                          _UINT32_(1) 
#define PINMUX_PA06B_AC_AIN0                       ((PIN_PA06B_AC_AIN0 << 16) | MUX_PA06B_AC_AIN0)
#define PORT_PA06B_AC_AIN0                         (_UINT32_(1) << 6)

