zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg00/include/pio/pic32ck1025sg00144.h
#define PIN_PC14E_EBI_A8                           _UINT32_(78)
#define MUX_PC14E_EBI_A8                           _UINT32_(4) 
#define PINMUX_PC14E_EBI_A8                        ((PIN_PC14E_EBI_A8 << 16) | MUX_PC14E_EBI_A8)
#define PORT_PC14E_EBI_A8                          (_UINT32_(1) << 14)

#define PIN_PC04E_EBI_A9                           _UINT32_(68)
#define MUX_PC04E_EBI_A9                           _UINT32_(4) 
#define PINMUX_PC04E_EBI_A9                        ((PIN_PC04E_EBI_A9 << 16) | MUX_PC04E_EBI_A9)
#define PORT_PC04E_EBI_A9                          (_UINT32_(1) << 4)

#define PIN_PC03E_EBI_A10                          _UINT32_(67)
#define MUX_PC03E_EBI_A10                          _UINT32_(4) 
#define PINMUX_PC03E_EBI_A10                       ((PIN_PC03E_EBI_A10 << 16) | MUX_PC03E_EBI_A10)
#define PORT_PC03E_EBI_A10                         (_UINT32_(1) << 3)

#define PIN_PC02E_EBI_A11                          _UINT32_(66)
#define MUX_PC02E_EBI_A11                          _UINT32_(4) 
#define PINMUX_PC02E_EBI_A11                       ((PIN_PC02E_EBI_A11 << 16) | MUX_PC02E_EBI_A11)
#define PORT_PC02E_EBI_A11                         (_UINT32_(1) << 2)

#define PIN_PC01E_EBI_A12                          _UINT32_(65)
#define MUX_PC01E_EBI_A12                          _UINT32_(4) 
#define PINMUX_PC01E_EBI_A12                       ((PIN_PC01E_EBI_A12 << 16) | MUX_PC01E_EBI_A12)
#define PORT_PC01E_EBI_A12                         (_UINT32_(1) << 1)

#define PIN_PC00E_EBI_A13                          _UINT32_(64)
#define MUX_PC00E_EBI_A13                          _UINT32_(4) 
#define PINMUX_PC00E_EBI_A13                       ((PIN_PC00E_EBI_A13 << 16) | MUX_PC00E_EBI_A13)
#define PORT_PC00E_EBI_A13                         (_UINT32_(1) << 0)

#define PIN_PB10E_EBI_A14                          _UINT32_(42)
#define MUX_PB10E_EBI_A14                          _UINT32_(4) 
#define PINMUX_PB10E_EBI_A14                       ((PIN_PB10E_EBI_A14 << 16) | MUX_PB10E_EBI_A14)
#define PORT_PB10E_EBI_A14                         (_UINT32_(1) << 10)

#define PIN_PB09E_EBI_A15                          _UINT32_(41)
#define MUX_PB09E_EBI_A15                          _UINT32_(4) 
#define PINMUX_PB09E_EBI_A15                       ((PIN_PB09E_EBI_A15 << 16) | MUX_PB09E_EBI_A15)
#define PORT_PB09E_EBI_A15                         (_UINT32_(1) << 9)

#define PIN_PC27E_EBI_A16                          _UINT32_(91)
#define MUX_PC27E_EBI_A16                          _UINT32_(4) 
#define PINMUX_PC27E_EBI_A16                       ((PIN_PC27E_EBI_A16 << 16) | MUX_PC27E_EBI_A16)
#define PORT_PC27E_EBI_A16                         (_UINT32_(1) << 27)

#define PIN_PD08E_EBI_A16                          _UINT32_(104)
#define MUX_PD08E_EBI_A16                          _UINT32_(4) 
#define PINMUX_PD08E_EBI_A16                       ((PIN_PD08E_EBI_A16 << 16) | MUX_PD08E_EBI_A16)
#define PORT_PD08E_EBI_A16                         (_UINT32_(1) << 8)

#define PIN_PC26E_EBI_A17                          _UINT32_(90)
#define MUX_PC26E_EBI_A17                          _UINT32_(4) 
#define PINMUX_PC26E_EBI_A17                       ((PIN_PC26E_EBI_A17 << 16) | MUX_PC26E_EBI_A17)
#define PORT_PC26E_EBI_A17                         (_UINT32_(1) << 26)

#define PIN_PD07E_EBI_A17                          _UINT32_(103)
#define MUX_PD07E_EBI_A17                          _UINT32_(4) 
#define PINMUX_PD07E_EBI_A17                       ((PIN_PD07E_EBI_A17 << 16) | MUX_PD07E_EBI_A17)
#define PORT_PD07E_EBI_A17                         (_UINT32_(1) << 7)

#define PIN_PB25E_EBI_A18                          _UINT32_(57)
#define MUX_PB25E_EBI_A18                          _UINT32_(4) 
#define PINMUX_PB25E_EBI_A18                       ((PIN_PB25E_EBI_A18 << 16) | MUX_PB25E_EBI_A18)
#define PORT_PB25E_EBI_A18                         (_UINT32_(1) << 25)

#define PIN_PD06E_EBI_A18                          _UINT32_(102)
#define MUX_PD06E_EBI_A18                          _UINT32_(4) 
#define PINMUX_PD06E_EBI_A18                       ((PIN_PD06E_EBI_A18 << 16) | MUX_PD06E_EBI_A18)
#define PORT_PD06E_EBI_A18                         (_UINT32_(1) << 6)

#define PIN_PB24E_EBI_A19                          _UINT32_(56)
#define MUX_PB24E_EBI_A19                          _UINT32_(4) 
#define PINMUX_PB24E_EBI_A19                       ((PIN_PB24E_EBI_A19 << 16) | MUX_PB24E_EBI_A19)
#define PORT_PB24E_EBI_A19                         (_UINT32_(1) << 24)

#define PIN_PD02E_EBI_A19                          _UINT32_(98)
#define MUX_PD02E_EBI_A19                          _UINT32_(4) 
#define PINMUX_PD02E_EBI_A19                       ((PIN_PD02E_EBI_A19 << 16) | MUX_PD02E_EBI_A19)
#define PORT_PD02E_EBI_A19                         (_UINT32_(1) << 2)

#define PIN_PB23E_EBI_A20                          _UINT32_(55)
#define MUX_PB23E_EBI_A20                          _UINT32_(4) 
#define PINMUX_PB23E_EBI_A20                       ((PIN_PB23E_EBI_A20 << 16) | MUX_PB23E_EBI_A20)
#define PORT_PB23E_EBI_A20                         (_UINT32_(1) << 23)

#define PIN_PB22E_EBI_A21                          _UINT32_(54)
#define MUX_PB22E_EBI_A21                          _UINT32_(4) 
#define PINMUX_PB22E_EBI_A21                       ((PIN_PB22E_EBI_A21 << 16) | MUX_PB22E_EBI_A21)
#define PORT_PB22E_EBI_A21                         (_UINT32_(1) << 22)

#define PIN_PB21E_EBI_A22                          _UINT32_(53)
#define MUX_PB21E_EBI_A22                          _UINT32_(4) 
#define PINMUX_PB21E_EBI_A22                       ((PIN_PB21E_EBI_A22 << 16) | MUX_PB21E_EBI_A22)
#define PORT_PB21E_EBI_A22                         (_UINT32_(1) << 21)

#define PIN_PC28E_EBI_A23                          _UINT32_(92)
#define MUX_PC28E_EBI_A23                          _UINT32_(4) 
#define PINMUX_PC28E_EBI_A23                       ((PIN_PC28E_EBI_A23 << 16) | MUX_PC28E_EBI_A23)
#define PORT_PC28E_EBI_A23                         (_UINT32_(1) << 28)

#define PIN_PA13E_EBI_D0                           _UINT32_(13)
#define MUX_PA13E_EBI_D0                           _UINT32_(4) 
#define PINMUX_PA13E_EBI_D0                        ((PIN_PA13E_EBI_D0 << 16) | MUX_PA13E_EBI_D0)
#define PORT_PA13E_EBI_D0                          (_UINT32_(1) << 13)

#define PIN_PA14E_EBI_D1                           _UINT32_(14)
#define MUX_PA14E_EBI_D1                           _UINT32_(4) 
#define PINMUX_PA14E_EBI_D1                        ((PIN_PA14E_EBI_D1 << 16) | MUX_PA14E_EBI_D1)
#define PORT_PA14E_EBI_D1                          (_UINT32_(1) << 14)

#define PIN_PA15E_EBI_D2                           _UINT32_(15)
#define MUX_PA15E_EBI_D2                           _UINT32_(4) 
#define PINMUX_PA15E_EBI_D2                        ((PIN_PA15E_EBI_D2 << 16) | MUX_PA15E_EBI_D2)
#define PORT_PA15E_EBI_D2                          (_UINT32_(1) << 15)

#define PIN_PA16E_EBI_D3                           _UINT32_(16)
#define MUX_PA16E_EBI_D3                           _UINT32_(4) 
#define PINMUX_PA16E_EBI_D3                        ((PIN_PA16E_EBI_D3 << 16) | MUX_PA16E_EBI_D3)
#define PORT_PA16E_EBI_D3                          (_UINT32_(1) << 16)

#define PIN_PA17E_EBI_D4                           _UINT32_(17)
#define MUX_PA17E_EBI_D4                           _UINT32_(4) 
#define PINMUX_PA17E_EBI_D4                        ((PIN_PA17E_EBI_D4 << 16) | MUX_PA17E_EBI_D4)
#define PORT_PA17E_EBI_D4                          (_UINT32_(1) << 17)

