zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg00/include/pio/pic32ck1025sg00144.h
#define PIN_PA13A_EIC_EXTINT13                     _UINT32_(13)
#define MUX_PA13A_EIC_EXTINT13                     _UINT32_(0) 
#define PINMUX_PA13A_EIC_EXTINT13                  ((PIN_PA13A_EIC_EXTINT13 << 16) | MUX_PA13A_EIC_EXTINT13)
#define PORT_PA13A_EIC_EXTINT13                    (_UINT32_(1) << 13)
#define PIN_PA13A_EIC_EXTINT_NUM                   _UINT32_(13) /* EIC signal: PIN_PA13 External Interrupt Line */

#define PIN_PB13A_EIC_EXTINT13                     _UINT32_(45)
#define MUX_PB13A_EIC_EXTINT13                     _UINT32_(0) 
#define PINMUX_PB13A_EIC_EXTINT13                  ((PIN_PB13A_EIC_EXTINT13 << 16) | MUX_PB13A_EIC_EXTINT13)
#define PORT_PB13A_EIC_EXTINT13                    (_UINT32_(1) << 13)
#define PIN_PB13A_EIC_EXTINT_NUM                   _UINT32_(13) /* EIC signal: PIN_PB13 External Interrupt Line */

#define PIN_PC13A_EIC_EXTINT13                     _UINT32_(77)
#define MUX_PC13A_EIC_EXTINT13                     _UINT32_(0) 
#define PINMUX_PC13A_EIC_EXTINT13                  ((PIN_PC13A_EIC_EXTINT13 << 16) | MUX_PC13A_EIC_EXTINT13)
#define PORT_PC13A_EIC_EXTINT13                    (_UINT32_(1) << 13)
#define PIN_PC13A_EIC_EXTINT_NUM                   _UINT32_(13) /* EIC signal: PIN_PC13 External Interrupt Line */

#define PIN_PC29A_EIC_EXTINT13                     _UINT32_(93)
#define MUX_PC29A_EIC_EXTINT13                     _UINT32_(0) 
#define PINMUX_PC29A_EIC_EXTINT13                  ((PIN_PC29A_EIC_EXTINT13 << 16) | MUX_PC29A_EIC_EXTINT13)
#define PORT_PC29A_EIC_EXTINT13                    (_UINT32_(1) << 29)
#define PIN_PC29A_EIC_EXTINT_NUM                   _UINT32_(13) /* EIC signal: PIN_PC29 External Interrupt Line */

#define PIN_PD13A_EIC_EXTINT13                     _UINT32_(109)
#define MUX_PD13A_EIC_EXTINT13                     _UINT32_(0) 
#define PINMUX_PD13A_EIC_EXTINT13                  ((PIN_PD13A_EIC_EXTINT13 << 16) | MUX_PD13A_EIC_EXTINT13)
#define PORT_PD13A_EIC_EXTINT13                    (_UINT32_(1) << 13)
#define PIN_PD13A_EIC_EXTINT_NUM                   _UINT32_(13) /* EIC signal: PIN_PD13 External Interrupt Line */

#define PIN_PA00A_EIC_EXTINT14                     _UINT32_(0) 
#define MUX_PA00A_EIC_EXTINT14                     _UINT32_(0) 
#define PINMUX_PA00A_EIC_EXTINT14                  ((PIN_PA00A_EIC_EXTINT14 << 16) | MUX_PA00A_EIC_EXTINT14)
#define PORT_PA00A_EIC_EXTINT14                    (_UINT32_(1) << 0)
#define PIN_PA00A_EIC_EXTINT_NUM                   _UINT32_(14) /* EIC signal: PIN_PA00 External Interrupt Line */

#define PIN_PB14A_EIC_EXTINT14                     _UINT32_(46)
#define MUX_PB14A_EIC_EXTINT14                     _UINT32_(0) 
#define PINMUX_PB14A_EIC_EXTINT14                  ((PIN_PB14A_EIC_EXTINT14 << 16) | MUX_PB14A_EIC_EXTINT14)
#define PORT_PB14A_EIC_EXTINT14                    (_UINT32_(1) << 14)
#define PIN_PB14A_EIC_EXTINT_NUM                   _UINT32_(14) /* EIC signal: PIN_PB14 External Interrupt Line */

#define PIN_PC14A_EIC_EXTINT14                     _UINT32_(78)
#define MUX_PC14A_EIC_EXTINT14                     _UINT32_(0) 
#define PINMUX_PC14A_EIC_EXTINT14                  ((PIN_PC14A_EIC_EXTINT14 << 16) | MUX_PC14A_EIC_EXTINT14)
#define PORT_PC14A_EIC_EXTINT14                    (_UINT32_(1) << 14)
#define PIN_PC14A_EIC_EXTINT_NUM                   _UINT32_(14) /* EIC signal: PIN_PC14 External Interrupt Line */

#define PIN_PD14A_EIC_EXTINT14                     _UINT32_(110)
#define MUX_PD14A_EIC_EXTINT14                     _UINT32_(0) 
#define PINMUX_PD14A_EIC_EXTINT14                  ((PIN_PD14A_EIC_EXTINT14 << 16) | MUX_PD14A_EIC_EXTINT14)
#define PORT_PD14A_EIC_EXTINT14                    (_UINT32_(1) << 14)
#define PIN_PD14A_EIC_EXTINT_NUM                   _UINT32_(14) /* EIC signal: PIN_PD14 External Interrupt Line */

#define PIN_PA14A_EIC_EXTINT14                     _UINT32_(14)
#define MUX_PA14A_EIC_EXTINT14                     _UINT32_(0) 
#define PINMUX_PA14A_EIC_EXTINT14                  ((PIN_PA14A_EIC_EXTINT14 << 16) | MUX_PA14A_EIC_EXTINT14)
#define PORT_PA14A_EIC_EXTINT14                    (_UINT32_(1) << 14)
#define PIN_PA14A_EIC_EXTINT_NUM                   _UINT32_(14) /* EIC signal: PIN_PA14 External Interrupt Line */

#define PIN_PA15A_EIC_EXTINT15                     _UINT32_(15)
#define MUX_PA15A_EIC_EXTINT15                     _UINT32_(0) 
#define PINMUX_PA15A_EIC_EXTINT15                  ((PIN_PA15A_EIC_EXTINT15 << 16) | MUX_PA15A_EIC_EXTINT15)
#define PORT_PA15A_EIC_EXTINT15                    (_UINT32_(1) << 15)
#define PIN_PA15A_EIC_EXTINT_NUM                   _UINT32_(15) /* EIC signal: PIN_PA15 External Interrupt Line */

#define PIN_PB15A_EIC_EXTINT15                     _UINT32_(47)
#define MUX_PB15A_EIC_EXTINT15                     _UINT32_(0) 
#define PINMUX_PB15A_EIC_EXTINT15                  ((PIN_PB15A_EIC_EXTINT15 << 16) | MUX_PB15A_EIC_EXTINT15)
#define PORT_PB15A_EIC_EXTINT15                    (_UINT32_(1) << 15)
#define PIN_PB15A_EIC_EXTINT_NUM                   _UINT32_(15) /* EIC signal: PIN_PB15 External Interrupt Line */

#define PIN_PC15A_EIC_EXTINT15                     _UINT32_(79)
#define MUX_PC15A_EIC_EXTINT15                     _UINT32_(0) 
#define PINMUX_PC15A_EIC_EXTINT15                  ((PIN_PC15A_EIC_EXTINT15 << 16) | MUX_PC15A_EIC_EXTINT15)
#define PORT_PC15A_EIC_EXTINT15                    (_UINT32_(1) << 15)
#define PIN_PC15A_EIC_EXTINT_NUM                   _UINT32_(15) /* EIC signal: PIN_PC15 External Interrupt Line */

#define PIN_PD15A_EIC_EXTINT15                     _UINT32_(111)
#define MUX_PD15A_EIC_EXTINT15                     _UINT32_(0) 
#define PINMUX_PD15A_EIC_EXTINT15                  ((PIN_PD15A_EIC_EXTINT15 << 16) | MUX_PD15A_EIC_EXTINT15)
#define PORT_PD15A_EIC_EXTINT15                    (_UINT32_(1) << 15)
#define PIN_PD15A_EIC_EXTINT_NUM                   _UINT32_(15) /* EIC signal: PIN_PD15 External Interrupt Line */

#define PIN_PD02A_EIC_NMI                          _UINT32_(98)
#define MUX_PD02A_EIC_NMI                          _UINT32_(0) 
#define PINMUX_PD02A_EIC_NMI                       ((PIN_PD02A_EIC_NMI << 16) | MUX_PD02A_EIC_NMI)
#define PORT_PD02A_EIC_NMI                         (_UINT32_(1) << 2)

/* ================== PORT definition for GCLK peripheral =================== */
#define PIN_PA09M_GCLK_IO0                         _UINT32_(9) 
#define MUX_PA09M_GCLK_IO0                         _UINT32_(12)
#define PINMUX_PA09M_GCLK_IO0                      ((PIN_PA09M_GCLK_IO0 << 16) | MUX_PA09M_GCLK_IO0)
#define PORT_PA09M_GCLK_IO0                        (_UINT32_(1) << 9)

#define PIN_PA03M_GCLK_IO0                         _UINT32_(3) 
#define MUX_PA03M_GCLK_IO0                         _UINT32_(12)
#define PINMUX_PA03M_GCLK_IO0                      ((PIN_PA03M_GCLK_IO0 << 16) | MUX_PA03M_GCLK_IO0)
#define PORT_PA03M_GCLK_IO0                        (_UINT32_(1) << 3)

#define PIN_PA01M_GCLK_IO1                         _UINT32_(1) 
#define MUX_PA01M_GCLK_IO1                         _UINT32_(12)
#define PINMUX_PA01M_GCLK_IO1                      ((PIN_PA01M_GCLK_IO1 << 16) | MUX_PA01M_GCLK_IO1)
#define PORT_PA01M_GCLK_IO1                        (_UINT32_(1) << 1)

#define PIN_PA10M_GCLK_IO1                         _UINT32_(10)
#define MUX_PA10M_GCLK_IO1                         _UINT32_(12)
#define PINMUX_PA10M_GCLK_IO1                      ((PIN_PA10M_GCLK_IO1 << 16) | MUX_PA10M_GCLK_IO1)
#define PORT_PA10M_GCLK_IO1                        (_UINT32_(1) << 10)

