zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg00/include/pio/pic32ck1025sg00144.h
#define PIN_PC01F_TCC6_WO0                         _UINT32_(65)
#define MUX_PC01F_TCC6_WO0                         _UINT32_(5) 
#define PINMUX_PC01F_TCC6_WO0                      ((PIN_PC01F_TCC6_WO0 << 16) | MUX_PC01F_TCC6_WO0)
#define PORT_PC01F_TCC6_WO0                        (_UINT32_(1) << 1)

#define PIN_PB17F_TCC6_WO1                         _UINT32_(49)
#define MUX_PB17F_TCC6_WO1                         _UINT32_(5) 
#define PINMUX_PB17F_TCC6_WO1                      ((PIN_PB17F_TCC6_WO1 << 16) | MUX_PB17F_TCC6_WO1)
#define PORT_PB17F_TCC6_WO1                        (_UINT32_(1) << 17)

#define PIN_PB24F_TCC6_WO1                         _UINT32_(56)
#define MUX_PB24F_TCC6_WO1                         _UINT32_(5) 
#define PINMUX_PB24F_TCC6_WO1                      ((PIN_PB24F_TCC6_WO1 << 16) | MUX_PB24F_TCC6_WO1)
#define PORT_PB24F_TCC6_WO1                        (_UINT32_(1) << 24)

#define PIN_PC02F_TCC6_WO1                         _UINT32_(66)
#define MUX_PC02F_TCC6_WO1                         _UINT32_(5) 
#define PINMUX_PC02F_TCC6_WO1                      ((PIN_PC02F_TCC6_WO1 << 16) | MUX_PC02F_TCC6_WO1)
#define PORT_PC02F_TCC6_WO1                        (_UINT32_(1) << 2)

/* ================== PORT definition for TCC7 peripheral =================== */
#define PIN_PB07F_TCC7_WO0                         _UINT32_(39)
#define MUX_PB07F_TCC7_WO0                         _UINT32_(5) 
#define PINMUX_PB07F_TCC7_WO0                      ((PIN_PB07F_TCC7_WO0 << 16) | MUX_PB07F_TCC7_WO0)
#define PORT_PB07F_TCC7_WO0                        (_UINT32_(1) << 7)

#define PIN_PB25F_TCC7_WO0                         _UINT32_(57)
#define MUX_PB25F_TCC7_WO0                         _UINT32_(5) 
#define PINMUX_PB25F_TCC7_WO0                      ((PIN_PB25F_TCC7_WO0 << 16) | MUX_PB25F_TCC7_WO0)
#define PORT_PB25F_TCC7_WO0                        (_UINT32_(1) << 25)

#define PIN_PC03F_TCC7_WO0                         _UINT32_(67)
#define MUX_PC03F_TCC7_WO0                         _UINT32_(5) 
#define PINMUX_PC03F_TCC7_WO0                      ((PIN_PC03F_TCC7_WO0 << 16) | MUX_PC03F_TCC7_WO0)
#define PORT_PC03F_TCC7_WO0                        (_UINT32_(1) << 3)

#define PIN_PB08F_TCC7_WO1                         _UINT32_(40)
#define MUX_PB08F_TCC7_WO1                         _UINT32_(5) 
#define PINMUX_PB08F_TCC7_WO1                      ((PIN_PB08F_TCC7_WO1 << 16) | MUX_PB08F_TCC7_WO1)
#define PORT_PB08F_TCC7_WO1                        (_UINT32_(1) << 8)

#define PIN_PB26F_TCC7_WO1                         _UINT32_(58)
#define MUX_PB26F_TCC7_WO1                         _UINT32_(5) 
#define PINMUX_PB26F_TCC7_WO1                      ((PIN_PB26F_TCC7_WO1 << 16) | MUX_PB26F_TCC7_WO1)
#define PORT_PB26F_TCC7_WO1                        (_UINT32_(1) << 26)

#define PIN_PC04F_TCC7_WO1                         _UINT32_(68)
#define MUX_PC04F_TCC7_WO1                         _UINT32_(5) 
#define PINMUX_PC04F_TCC7_WO1                      ((PIN_PC04F_TCC7_WO1 << 16) | MUX_PC04F_TCC7_WO1)
#define PORT_PC04F_TCC7_WO1                        (_UINT32_(1) << 4)

/* =================== PORT definition for USB peripheral =================== */
#define PIN_PD03H_USB_DM                           _UINT32_(99)
#define MUX_PD03H_USB_DM                           _UINT32_(7) 
#define PINMUX_PD03H_USB_DM                        ((PIN_PD03H_USB_DM << 16) | MUX_PD03H_USB_DM)
#define PORT_PD03H_USB_DM                          (_UINT32_(1) << 3)

#define PIN_PD04H_USB_DP                           _UINT32_(100)
#define MUX_PD04H_USB_DP                           _UINT32_(7) 
#define PINMUX_PD04H_USB_DP                        ((PIN_PD04H_USB_DP << 16) | MUX_PD04H_USB_DP)
#define PORT_PD04H_USB_DP                          (_UINT32_(1) << 4)

#define PIN_PC01H_USB_SOF_1KHZ                     _UINT32_(65)
#define MUX_PC01H_USB_SOF_1KHZ                     _UINT32_(7) 
#define PINMUX_PC01H_USB_SOF_1KHZ                  ((PIN_PC01H_USB_SOF_1KHZ << 16) | MUX_PC01H_USB_SOF_1KHZ)
#define PORT_PC01H_USB_SOF_1KHZ                    (_UINT32_(1) << 1)

#define PIN_PD02H_USB_SOF_1KHZ                     _UINT32_(98)
#define MUX_PD02H_USB_SOF_1KHZ                     _UINT32_(7) 
#define PINMUX_PD02H_USB_SOF_1KHZ                  ((PIN_PD02H_USB_SOF_1KHZ << 16) | MUX_PD02H_USB_SOF_1KHZ)
#define PORT_PD02H_USB_SOF_1KHZ                    (_UINT32_(1) << 2)



#endif /* _pic32ck1025sg00144_GPIO_H_ */

